Autodesk.Revit.DB.FilterStringRuleEvaluator.Evaluate(System.String,System.String,System.Boolean)
Derived classes override this method to implement the test that determines
whether the two given string values satisfy the desired condition or not.
Remarks:
The arguments may be thought of as the left and right operands of a
binary expression; for example, "a < b", "x >= 100", etc.  The left
operand comes from an element in the Revit document (e.g., the value
of a parameter.)  The right operand is supplied by the user when
creating the filter that contains the rule that uses this evaluator.
lhs:
A value from an element in the document.
rhs:
The user-supplied value against which values from the document are tested.
caseSensitive:
If true, string comparisons are done case-sensitively.
Returns:
True if the given arguments satisfy the condition, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilterStringRuleEvaluator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FilterStringRuleEvaluator
Base for all classes that compare string values from Revit to a user-supplied filter value
Since:
2011